[
    {
        "title": "\"I'm Not A VIP...\": What PM Modi Said After Godhra Train Burning",
        "link": "https://www.ndtv.com/india-news/pm-modi-godhra-podcast-nikhil-kamath-did-whatever-i-could-to-handle-myself-pm-modi-on-godhra-train-burning-7444629",
        "description": "Answering a question on handling anxiety during a podcast with Zerodha co-founder Nikhil Kamath, PM Narendra Modi spoke about the Godhra train burning incident in February 2002 - in which 59 people were killed.",
        "full_text": "Answering a question on handling anxiety during a podcast with Zerodha co-founder Nikhil Kamath, Prime Minister Narendra Modi spoke about the Godhra train burning incident in February 2002 - in which 59 people were killed - which took place just three days after he became an MLA for the first time. \nPM Modi recalled how only a single-engine helicopter was available and his security team did not want him to fly on it. He also spoke about the emotions he felt when he visited the site and how he controlled them. \nThe Prime Minister said he became an MLA for the first time on February 24, 2002. He went to the Assembly for the first time three days later, on February 27, and that's when he heard of the incident. \n\"I had been an MLA for only three days. And, suddenly, I came to know about that big incident in Godhra. There was a fire on the train. I came to know, gradually, that people were dead. I was obviously very restless, I was worried. As soon as I came out of the Assembly, I said that I wanted to go to Godhra. So, I told them that we would go to Vadodara and take a helicopter from there. They said that there was no helicopter. I told them to arrange it from somewhere. I guess ONGC (Oil and Natural Gas Corporation) had one. It was a single-engine helicopter. They said they could not take a VIP. I said, 'I am not a VIP. I am a common man. I will go',\" he said in Hindi.\nThis, the PM said, led to a big argument and that's when he offered to give in writing that whatever happened would be his responsibility. \n\"And I reached Godhra. Now, with that terrible sight... numerous dead bodies... you can imagine... I am also a human being, I also felt things. But I was aware that, being in this post... I have to stay detached from my emotions, my natural tendency as a human being. I have to rise above it all. And I did whatever I could to handle myself,\" he recalled.\nResponding to the anxiety question, the PM also spoke about the Gujarat elections held later that same year. \n\"In 2002, there were elections in Gujarat. It was the biggest challenge of my life... I never watched TV and didn't check the results,\" the PM said.\n\"At 11:00 am or noon, I heard the beat of drums outside the chief minister's bungalow. I had told everyone not to inform me till 12 pm. Then our operator sent me a letter saying I was leading with a two-thirds majority. So, I don't believe that nothing affected me that day, but I had a thought to overpower that feeling,\" he explained. ",
        "image_url": "https://c.ndtvimg.com/2025-01/iaq7h978_pm-modi-podcast_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 20:16:00 +0530"
    },
    {
        "title": "\"All Fighting-Age Males Killed\": UK Special Forces Probed For War Crimes",
        "link": "https://www.ndtv.com/world-news/uk-special-forces-had-golden-pass-to-get-away-with-murder-in-afghanistan-7443057",
        "description": "An inquiry into the actions of British special forces in Afghanistan has uncovered allegations of extrajudicial killings and efforts to cover up unlawful actions during the war.",
        "full_text": "An inquiry into the actions of British special forces in Afghanistan has uncovered allegations of extrajudicial killings and efforts to cover up unlawful actions during the war. \nTestimonies and hundreds of documents released Wednesday reveal misconduct by elite soldiers operating in Afghanistan between 2010 and 2013, with one former officer describing the British Army's Special Air Service or SAS as having \"a golden pass allowing them to get away with murder.\"\nWar Crimes\nThe Afghanistan Inquiry, commissioned by the UK government's Ministry of Defence (MoD) in 2022, is investigating alleged war crimes by British armed forces during the Afghan conflict. The focus lies particularly on the actions of UK Special Forces (UKSF) units during night-time raids known as 'deliberate detention operations'.\nAccording to testimonies from seven UKSF personnel - given in secret due to national security concerns - troops carried out killings of unarmed Afghans, including individuals who posed no threat. One soldier, referred to as N1799 in the documents, testified that during some operations, \"all fighting-age males were killed on target regardless of the threat they posed.\" He recounted hearing that detainees were executed in compounds, sometimes using methods such as placing a pillow over a victim's head before shooting them.\nThe inquiry heard that some victims of these killings were under the age of 16. \nEvidence Of Cover-Up\nEmails and witness accounts provided to the inquiry show concerns among certain officers about the conduct of UKSF units. In one email from February 2011, an officer questioned whether SAS soldiers were deliberately setting up scenarios to justify killings, such as ordering detainees to retrieve weapons before shooting them. A senior officer acknowledged the issue, stating that there appeared to be \"a casual disregard for life\" and counterinsurgency principles.\nAnother officer, known as N2107, referred to the SAS and \"murder\" as \"regular bedfellows\" in emails. He told the inquiry that by 2011, he believed SAS units were committing extrajudicial killings. However, he admitted failing to escalate his concerns up the chain of command, which he now views as a \"massive failure of leadership.\"\nTestimonies show that operations were manipulated to suggest weapons were found alongside those killed, even when the individuals were unarmed. One soldier recounted being told that photos were staged to give the appearance that those killed had been combatants.\nOne officer described the SAS as being \"beyond reproach\" and said that questioning their actions was discouraged. An email revealed that support staff in Afghanistan who doubted the credibility of SAS reports were reprimanded to ensure they supported the \"guys on the ground.\"\nA senior officer told the inquiry that in the eyes of UKSF leadership, the SAS \"could do no wrong.\" This attitude allowed the regiment to operate with near-total impunity, with a focus on \"kill counts\" rather than lawful conduct.\nPolitical Implications\nThe allegations against UKSF have drawn comparisons to accusations of misconduct by US special operations forces during the Afghan conflict. British military police previously conducted investigations into allegations of war crimes by the SAS but concluded that there was insufficient evidence for prosecutions. \nThe MoD has refrained from commenting further, stating that it is \"appropriate to await the outcome\" of the inquiry. \nSeveral witnesses expressed fears about speaking out, citing concerns for their safety. N1799, for example, requested that two MoD representatives be removed from the inquiry room before he gave evidence, stating that he felt \"a bit sick.\"",
        "image_url": "https://c.ndtvimg.com/2025-01/bqum1hro_british-sas-generic-_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 16:41:00 +0530"
    },
    {
        "title": "\"I'm Only Human, Not God\": PM Modi In Podcast Debut With Zerodha Chief",
        "link": "https://www.ndtv.com/india-news/pm-modi-nikhil-kamath-zerodha-im-also-human-not-god-pm-modi-in-podcast-debut-with-zerodhas-chief-7442315",
        "description": "Prime Minister Narendra Modi, making his podcast debut on Zerodha co-founder Nikhil Kamath's People by WTF series, said that mistakes happen and he too is susceptible to making them.",
        "full_text": "Prime Minister Narendra Modi, making his podcast debut on Zerodha co-founder Nikhil Kamath's People by WTF series, said that mistakes happen and he too is susceptible to making them. \n\"Mistakes happen, and I too can make some. I am also a human, not god,\" PM Modi told Mr Kamath.\nThe Zerodha co-founder also shared his apprehension about his language skills in the beginning of the podcast, jokingly referring to his \"bad Hindi.\"\n\"Sir, please forgive me if my Hindi is not good. I am South Indian. I mostly grew up in Bangalore. My mother's city is Mysuru, where people mostly speak Kannada. My father was near Mangalore. I learned Hindi in school, but I don't have fluency in the language,\" Mr Kamath told PM Modi.\nTo this, the Prime Minister responded reassuringly, saying, \"Hum dono ki aise hi chalegi\" (We will manage together like this). I am sitting here in front of you and talking, I feel nervous. It's a tough conversation for me. This is my first podcast, I don't know how it'll go with your audience.\"\nWatch:\n\nThe two-hour podcast saw the Prime Minister sharing several anecdotes, including aspects of his childhood, education, entering politics, setbacks, handling stress and policy management, among others. \n\"I used to wash the clothes of all my family members. Because of that, I was allowed to go to the pond,\" PM Modi said. \nThe podcast trailer was shared by PM Modi himself on X, formerly Twitter. \"I hope you all enjoy this as much as we enjoyed creating it for you!\" PM Modi wrote.",
        "image_url": "https://c.ndtvimg.com/2025-01/q1qlselo_pm-modi-nikhil-kamath-_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 16:32:00 +0530"
    },
    {
        "title": "Out For A Jog, 14-Year-Old Rammed By Jaguar In Greater Noida, Critical",
        "link": "https://www.ndtv.com/india-news/hit-and-run-out-for-a-jog-14-year-old-rammed-by-jaguar-in-greater-noida-critical-7444142",
        "description": "A 14-year-old boy is critical after a speeding Jaguar rammed him while he was jogging on a service road in Greater Noida. The Jaguar driver fled after the accident and has now been arrested.",
        "full_text": "A 14-year-old boy is critical after a speeding Jaguar rammed him while he was jogging on a service road in Greater Noida. The Jaguar driver fled after the accident and has now been arrested. \nThe boy's father, a businessman, said Neeraj, 14, went for his morning run around 6 am on Thursday near Stellar Jeevan society in Sector 1 of Greater Noida West. He was jogging on a service road when a speeding Jaguar hit him from behind. The teenager suffered serious head and chest injuries and was rushed to a hospital, where his condition is said to be critical. \nNeeraj's father said that, along with his studies, the 14-year-old also works as a web developer. \nOfficials from the Birsakh police station said the driver of the Jaguar fled after the accident. A case was registered based on the father's complaint and the driver has now been taken into custody. The car has also been seized. \n ",
        "image_url": "https://c.ndtvimg.com/2025-01/f7p7od9o_jaguar-hitandrun_625x300_10_January_25.jpg",
        "publishing_date": "Fri, 10 Jan 2025 18:54:00 +0530"
    },
    {
        "title": "George Soros Indulges In Political Interference: Italy's Giorgia Meloni",
        "link": "https://www.ndtv.com/world-news/george-soros-indulges-in-political-interference-italys-giorgia-meloni-7443886",
        "description": "George Soros interferes in the domestic politics of other nations and uses his money to destabilise countries, Italian prime minister Giorgia Meloni said on Thursday.",
        "full_text": "George Soros interferes in the domestic politics of other nations and uses his money to destabilise countries, Italian prime minister Giorgia Meloni said on Thursday. Her remarks come at a time when Elon Musk is being criticised for his alleged interference in Europe's politics.\nMs Meloni said Elon Musk's comments about politics in Europe on his social media platform X does not pose a threat to democracy in any way. She compared him to billionaire George Soros, saying the latter is what a threat to democracy and political interference really looks like.\nClaiming that foreigners have for long been interfering in Europe's politics, the Italian prime minister questioned reporters saying, \"Elon Musk is only exercising his right to free speech\". She wondered if the problem was that he happens to be rich and has views that are 'right of centre'. \"Is the problem (with Elon Musk) that he is rich and influential? Or is it because he is not left-wing?\" she asked.\nCiting the example of George Soros, she went on to say that it is well-known how rich and powerful people with \"left-wing ideologies\" have indulged in political interference of other democracies, concluding that \"Musk does not pose a threat to democracies, George Soros does.,\" to which Elon Musk quickly responded on X, saying \"And Soros is being defeated.\"\nMs Meloni further said that she had not taken any money from Elon Musk, \"unlike those who have taken it from Soros\". She also denied media reports that her government in Italy is on the cusp of signing a giant, and controversial, cybersecurity deal with Elon Musk's company SpaceX.\nElon Musk, whose massive support to Donald Trump helped him win the US election, is now facing severe criticism by liberals across Europe for his string of attacks on several European leaders on his social media website X. In particular, Mr Musk has strongly targeted UK prime minister Kier Starmer and German Chancellor Olaf Scholz.\nThis has worried many in Europe, which is already seeing a surge in support for the right or far-right across the continent. Addressing those concerns at a press conference, Ms Meloni said Elon Musk's views on X can in no way be termed as \"dangerous interference\".\n\"It becomes a problem when wealthy people use their resources to finance certain political parties, associations, organisations and political exponents all over the world to influence the political choices of nation states,\" Ms Meloni said, adding that \"That's not what Musk is doing\".\n\"I am not aware of Elon Musk financing political parties, associations or political exponents around the world. This, for example, is what George Soros does - And yes, I consider that to be dangerous interference in the affairs of nation states and in their sovereignty,\" she said.\nGeorge Soros has used the wealth he has amassed as a financier in the 1970s and 80s to create the Open Society Foundations or OSF, which supports and funds a broad network of \"causes\" and NGOs worldwide, rang. His foundation reportedly claims that this is done to promote good-governance, liberal public policy initiatives, and democracy-building programmes. Though Soros and his foundation face serious charges of political interference, promoting social anarchy, funding political parties during elections, among others. He is often also targeted for anti-Semitic conspiracies.\n ",
        "image_url": "https://c.ndtvimg.com/2024-11/acg9g9vs_italian-pm-giorgia-meloni-ians_625x300_30_November_24.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 18:25:00 +0530"
    },
    {
        "title": "\"He's Deeply Unwell\": Elon Musk's Biographer Makes Big Claims",
        "link": "https://www.ndtv.com/world-news/elon-musk-protect-america-from-elon-musk-tesla-chiefs-biographer-says-hes-mad-7441861",
        "description": "Seth Abramson, a biographer of Elon Musk, has made some big claims about the mental health and decision-making of the Tesla and SpaceX CEO, warning that his influence and actions could have dangerous implications for the United States.",
        "full_text": "Seth Abramson, a biographer of Elon Musk, has made some big claims about the mental health and decision-making of the Tesla and SpaceX CEO, warning that his influence and actions could have dangerous implications for the United States. In a series of posts on X, the platform owned by Musk, Abramson alleged that Musk may be \"going mad\" and called for immediate government intervention.\nAbramson, who claims to have closely followed Musk's behaviour for two years, cited the billionaire's acknowledged struggles with mental health, drug use, and stress. \"I'm a Musk biographer who has been tracking his online behavior for the last two years - and given that he's admitted to all of mental illness, heavy drug use, and crippling stress, it is now reasonable to fear he is deeply unwell,\" Abramson wrote. \"Protect America from Elon Musk.\"\n\nI legitimately believe Elon Musk may be going mad. I'm a Musk biographer who has been tracking his online behavior for the last two years—and given that he's admitted to all of mental illness, heavy drug use, and crippling stress, it is now reasonable to fear he is deeply unwell.\n— Seth Abramson (@SethAbramson) January 6, 2025\nThe biographer pointed to Musk's prominent role in several critical sectors, including aerospace, electric vehicles, social media, and artificial intelligence, as well as his appointment as the incoming head of the Department of Government Efficiency (DOGE) under the Trump administration. Abramson argued that Musk's control over \"civilization-essential industries\" and his position in the government transition team create a situation that could jeopardize national stability.\n\"His holdings across many civilization-essential industries and the fact that he's the incoming POTUS mean that his madness and increasing incitement of violence endanger us all,\" Abramson claimed.\nAbramson urged the current administration to take action during its final weeks in office, including terminating government contracts with Musk, filing lawsuits against what he described as unconstitutional initiatives under DOGE.\n\"For 14 days more, the administration is in a position to take urgent action to protect America from Elon Musk,\" Abramson wrote. \nMusk has been increasingly vocal on X, engaging in contentious debates and making polarising statements. Recently, he criticised the UK government for rejecting calls for a public inquiry into a grooming scandal in Oldham and accused UK Prime Minister Keir Starmer of failing to prosecute perpetrators during his tenure as Director of Public Prosecutions. Musk described these incidents as a \"massive crime against humanity.\"\nMusk has also expressed support for Tommy Robinson, founder of the far-right English Defence League, who is serving an 18-month jail term for contempt of court. \nAbramson's warnings have sparked debate among X users. While some echoed his concerns, criticising Musk's erratic behaviour, others defended the billionaire's vision. One user described Musk as a \"thin-skinned, drug-addled Bond villain,\" while another speculated that Musk sees himself as a guardian of Western culture.\nMusk's mental health has been a subject of speculation in the past. Reports emerged last year of a mental breakdown following his public booing at a Dave Chappelle show in San Francisco, shortly after he acquired Twitter for $44 billion.",
        "image_url": "https://c.ndtvimg.com/2024-11/04dtmd6g_elon-musk_625x300_22_November_24.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 13:53:00 +0530"
    },
    {
        "title": "\"I Hold Such A Position...\": PM On Handling Restlessness, Anxiety",
        "link": "https://www.ndtv.com/india-news/pm-modi-nikhil-kamath-podcast-i-go-along-with-my-mission-pm-on-countering-restlessness-anxiety-7443119",
        "description": "Offering a very different mantra for handling anxiety, Prime Minister Narendra Modi has said that while he does feel anxious, he is in a position where he has to control his emotions and one way of doing that is by going along with one's mission.",
        "full_text": "Offering a very different mantra for handling anxiety, Prime Minister Narendra Modi has said that while he does feel anxious, he is in a position where he has to control his emotions and one way of doing that is to counter restlessness by going along with one's mission.\nIn a podcast with Nikhil Kamath, the co-founder of Zerodha, the Prime Minister cited examples of how he dealt with the 2002 Gujarat elections - which he called the biggest challenge of his life - blasts in the state and the Godhra train burning incident.\n\"You see, to manage these things, everyone has his own ability and individual style... I hold such a position that I have to control my emotions -- the natural tendency that human beings have, I will have to stay detached from all of that. I will have to rise above all that. For example, in 2002, there were elections in Gujarat. It was the biggest challenge of my life... I never watched TV and didn't check the results,\" the PM said in Hindi.\n\"At 11:00 am or noon, I heard the beat of drums outside the chief minister's bungalow. I had told everyone not to inform me till 12 pm. Then our operator sent me a letter saying I was leading with a two-thirds majority. So, I don't believe that nothing affected me that day, but I had a thought to overpower that feeling. You can say that there was restlessness and anxiety inside me,\" he explained. \nTalking about bomb blasts in Gujarat, the Prime Minister, who was the chief minister of the state at the time, said he visited hospitals and the police control room despite his security team asking him not to. \n\"There were bombings in five places. You can imagine my situation, being the Chief Minister of the state. So, I said that I wanted to go to the police control room. But my security team refused. They said, 'Sir, it will be unsafe for you to go'. I said, 'Whatever happens will happen, I will go'. They were very worried. Finally, I sat in the car. I said that I would go to the hospital first. They said that there were bombings in the hospitals too. I said again, 'Whatever happens, I will go'. You can say that there was restlessness and anxiety inside me. But my approach was that I would go along with my mission. Maybe I experience that in a different way. I feel a sense of responsibility towards it,\" he said. \nRecalling the Godhra train burning, PM Modi said he became an MLA for the first time on February 24, 2002. He went to the Assembly for the first time three days later, on February 27.\n\"I had been an MLA for only three days. And, suddenly, I came to know about that big incident in Godhra. There was a fire on the train. I came to know, gradually, that people were dead. I was obviously very restless, I was worried. As soon as I came out of the Assembly, I said that I wanted to go to Godhra. So, I told them that we would go to Vadodara and take a helicopter from there. They said that there was no helicopter. I told them to arrange it from somewhere. I guess ONGC (Oil and Natural Gas Corporation) had one. It was a single-engine helicopter. They said they could not take a VIP. I said, 'I am not a VIP. I am a common man. I will go',\" he said.\nThe PM said there was a big fight and he offered to give in writing that he would take responsibility for whatever happened and he would go on the single-engine helicopter. \n\"And I reached Godhra. Now, with that painful sight... several dead bodies... you can imagine... I am also a human being, I also felt things. But I was aware that, being in this post... I have to stay detached from my emotions, my natural tendency as a human being. I have to rise above it all. And I did whatever I could to handle myself,\" he recalled.\nPM Modi said that when he interacts with students during 'Pariksha Pe Charcha' events, he tells them to treat exams as a routine activity and act accordingly.\nWorst-Case Scenarios?\nAsked whether his style of thinking was that he would take worst-case scenarios into account, the Prime Minister said, \"I have never thought of life or death. This is probably for people who live life in a calculated manner. Perhaps I will not be able to answer this. Because, wherever I am today, I had never planned for that... When I became a chief minister, I was surprised how I became one. So, I had never chosen this path for myself. I have got a responsibility, I am doing it. Doing it well is my objective. But I didn't start off with this in mind. \n\"That is why I don't know how to calculate. It happens in ordinary life. Perhaps I am an exception. Because my background is such that I can never think like that. My background is such that if I had become a primary school teacher, my mother would have distributed sweets in the locality. She would have said, 'See, my son has become a teacher'. That is why I never had such aspirations. I never thought, 'If this doesn't happen, then what?' I don't burden myself with such thoughts,\" he added. ",
        "image_url": "https://c.ndtvimg.com/2025-01/s7l1t1ko_pm-modi-podcast_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 19:51:00 +0530"
    },
    {
        "title": "PM Modi Reacts To Memes Featuring Italy's PM: \"Wo Toh Chalta Rehta Hai\"",
        "link": "https://www.ndtv.com/world-news/pm-modi-nikhil-kamath-zerodha-pm-modi-reacts-to-memes-featuring-italys-pm-giorgia-meloni-wo-toh-chalta-rehta-hai-7444630",
        "description": "Prime Minister Narendra Modi responded to the viral memes featuring him and Italian PM Giorgia Meloni.",
        "full_text": "Prime Minister Narendra Modi, making his podcast debut on Zerodha co-founder Nikhil Kamath's People by WTF series, said that he is aware of the memes that have been viral on social media for the last 1-2 years related to him and Italian Prime Minister Giorgia Meloni. In this light-hearted conversation, Mr. Kamath asked the question about the viral \"Melodi Memes\" featuring him and Italian Prime Minister Giorgia Meloni.\nAlso Read | \"I'm Only Human, Not God\": PM Modi In Podcast Debut With Zerodha Chief Nikhil Kamath\n\"PM Sir, as we are talking about other countries, if I may digress a little, I must say my favourite food is pizza, which originates from Italy. People often say that you know a lot about Italy. Would you like to share something about it? Haven't you seen those memes?\" he asked again.\nWatch the video here: \n\nTo this, the Prime Minister responded, \"Wo toh chalta rehta hai\" (that's an ongoing thing). \"I don't waste my time on that,\" he added.\nThe two-hour podcast saw the Prime Minister sharing several anecdotes, including aspects of his childhood, education, entering politics, setbacks, handling stress, and policy management, among others.\nThe podcast trailer was shared by PM Modi himself on X, formerly Twitter. \"I hope you all enjoy this as much as we enjoyed creating it for you!\" PM Modi wrote.",
        "image_url": "https://c.ndtvimg.com/2025-01/2i3le3oo_prime-minister-narendra-modi_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 20:15:00 +0530"
    },
    {
        "title": "\"Find A Quiet Place\": Lip Readers Decipher Trump, Obama's Conversation",
        "link": "https://www.ndtv.com/world-news/find-a-quiet-place-lip-readers-decipher-trump-obamas-conversation-7443780",
        "description": "A conversation between former US President Barack Obama and President-elect Donald Trump, two political rivals, at the state funeral of ex-President Jimmy Carter, is going viral.",
        "full_text": "A conversation between former US President Barack Obama and President-elect Donald Trump, two political rivals, at the state funeral of ex-President Jimmy Carter, is going viral. Lip readers and experts have attempted to decode what Trump and Obama were talking about.\nSitting in the second row, Trump and Obama were sitting next to each other and discussing something. Trump says something to Obama, who laughs and responds. What's even more interesting is Vice President Kamala Harris, who was backed by Obama in the Presidential campaign, sat in front of the Presidents and saw them having a conversation.\n\nWhat Lip Readers Claim?\nTrump: I've pulled out of that. It's the conditions. Can you imagine that?\"\nTrump: \"...and after, I will.\"\nTrump: \"Call me at the foy after, yep.\"\nObama: \"Can you just ... it should be good.\"\nTrump: \"I can't talk, we have to find a quiet place sometime. This is a matter of importance and we need to do this outside so that we can deal with it, certainly, today.\n\n\nNEW: Trump told Obama he had to find a quiet place to speak with him regarding an urgent “matter of importance,” according to the New York Post.\n\nThe revelation was made by forensic lip reader Jeremy Freeman.\n\nTrump: “I've pulled out of that. It's the conditions. Can you imagine… pic.twitter.com/BxSrm8XLBH\n— Collin Rugg (@CollinRugg) January 9, 2025\nBritish news website, Sky News, deciphered the conversation between Trump and Obama and posted a video on X.\n\nBarack Obama and Donald Trump were spotted chatting at Jimmy Carter's funeral.\n\nHere's what a lip reader could make of their conversation - do you agree? 💬🗨 pic.twitter.com/1uz014XNYX\n— Sky News (@SkyNews) January 9, 2025\nNDTV cannot independently verify the claims made by the lip readers.\nThe New York Post quoted a forensic lip reader, Jeremy Freeman and said in its report, \"Trump cautioned Obama that they would have to \"find a quiet place\" later in the day to discuss a \"matter of importance.\"\n\n\nPhoto Credit: AFP\n\nThe context of the conversation is unclear. But, Freeman suggests that the ex-President and President-elect were discussing international agreements at Jimmy Carter's funeral\nTrump leaned toward Obama and said, \"I've pulled out of that. It's the conditions. Can you imagine that?\" \nFreeman suggests that the two leaders are talking about the Iran nuclear deal of 2015, signed by Obama and then Trump withdrew from it in 2018.\nThe funeral brought a brief moment of unity in divided America which saw five Presidents - George Bush, Barack Obama, Joe Biden, Bill Clinton and Donald Trump - come together to pay their respects to President Carter.\n\n\nPhoto Credit: AFP\nEx-Presidents Bill Clinton, George W Bush, and Barack Obama, along with President-elect Trump and President Biden\n\nArch Rivals\nIn 2016, Donald Trump became the 45th President of the United States, taking over from Barack Obama after defeating Hilary Clinton. Trump was out of office four years later and Joe Biden came to power, four years later, Trump is back in office and will be sworn in on January 20.\nDuring the election campaign, Obama blasted Donald Trump, saying that the Republican candidate cares only about \"his ego, money and status\".\n\"I have said it before and I am gonna say it again, Donald Trump is a 78-year-old billionaire who has not stopped whining about his problem since he rode down that golden escalator nine years ago. He is constantly complaining, and when he is not complaining, he is trying to sell you stuff,\" he said.\nFrom personal attacks to criticism of the Biden administration's policies, Trump's campaign, which was backed by the world's richest man - Elon Musk - had no holds barred.\nThe Obamas teamed up to back Kamala Harris but the Vice President lost the election after a landslide win by Trump who won all the seven swing states.",
        "image_url": "https://c.ndtvimg.com/2025-01/0km27328_donald-trump-obama_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 18:02:00 +0530"
    },
    {
        "title": "\"I Hold Such A Position...\": PM On Handling Restlessness, Anxiety",
        "link": "https://www.ndtv.com/india-news/pm-modi-nikhil-kamath-podcast-i-go-along-with-my-mission-pm-on-countering-restlessness-anxiety-7443119",
        "description": "Offering a very different mantra for handling anxiety, Prime Minister Narendra Modi has said that while he does feel anxious, he is in a position where he has to control his emotions and one way of doing that is by going along with one's mission.",
        "full_text": "Offering a very different mantra for handling anxiety, Prime Minister Narendra Modi has said that while he does feel anxious, he is in a position where he has to control his emotions and one way of doing that is to counter restlessness by going along with one's mission.\nIn a podcast with Nikhil Kamath, the co-founder of Zerodha, the Prime Minister cited examples of how he dealt with the 2002 Gujarat elections - which he called the biggest challenge of his life - blasts in the state and the Godhra train burning incident.\n\"You see, to manage these things, everyone has his own ability and individual style... I hold such a position that I have to control my emotions -- the natural tendency that human beings have, I will have to stay detached from all of that. I will have to rise above all that. For example, in 2002, there were elections in Gujarat. It was the biggest challenge of my life... I never watched TV and didn't check the results,\" the PM said in Hindi.\n\"At 11:00 am or noon, I heard the beat of drums outside the chief minister's bungalow. I had told everyone not to inform me till 12 pm. Then our operator sent me a letter saying I was leading with a two-thirds majority. So, I don't believe that nothing affected me that day, but I had a thought to overpower that feeling. You can say that there was restlessness and anxiety inside me,\" he explained. \nTalking about bomb blasts in Gujarat, the Prime Minister, who was the chief minister of the state at the time, said he visited hospitals and the police control room despite his security team asking him not to. \n\"There were bombings in five places. You can imagine my situation, being the Chief Minister of the state. So, I said that I wanted to go to the police control room. But my security team refused. They said, 'Sir, it will be unsafe for you to go'. I said, 'Whatever happens will happen, I will go'. They were very worried. Finally, I sat in the car. I said that I would go to the hospital first. They said that there were bombings in the hospitals too. I said again, 'Whatever happens, I will go'. You can say that there was restlessness and anxiety inside me. But my approach was that I would go along with my mission. Maybe I experience that in a different way. I feel a sense of responsibility towards it,\" he said. \nRecalling the Godhra train burning, PM Modi said he became an MLA for the first time on February 24, 2002. He went to the Assembly for the first time three days later, on February 27.\n\"I had been an MLA for only three days. And, suddenly, I came to know about that big incident in Godhra. There was a fire on the train. I came to know, gradually, that people were dead. I was obviously very restless, I was worried. As soon as I came out of the Assembly, I said that I wanted to go to Godhra. So, I told them that we would go to Vadodara and take a helicopter from there. They said that there was no helicopter. I told them to arrange it from somewhere. I guess ONGC (Oil and Natural Gas Corporation) had one. It was a single-engine helicopter. They said they could not take a VIP. I said, 'I am not a VIP. I am a common man. I will go',\" he said.\nThe PM said there was a big fight and he offered to give in writing that he would take responsibility for whatever happened and he would go on the single-engine helicopter. \n\"And I reached Godhra. Now, with that painful sight... several dead bodies... you can imagine... I am also a human being, I also felt things. But I was aware that, being in this post... I have to stay detached from my emotions, my natural tendency as a human being. I have to rise above it all. And I did whatever I could to handle myself,\" he recalled.\nPM Modi said that when he interacts with students during 'Pariksha Pe Charcha' events, he tells them to treat exams as a routine activity and act accordingly.\nWorst-Case Scenarios?\nAsked whether his style of thinking was that he would take worst-case scenarios into account, the Prime Minister said, \"I have never thought of life or death. This is probably for people who live life in a calculated manner. Perhaps I will not be able to answer this. Because, wherever I am today, I had never planned for that... When I became a chief minister, I was surprised how I became one. So, I had never chosen this path for myself. I have got a responsibility, I am doing it. Doing it well is my objective. But I didn't start off with this in mind. \n\"That is why I don't know how to calculate. It happens in ordinary life. Perhaps I am an exception. Because my background is such that I can never think like that. My background is such that if I had become a primary school teacher, my mother would have distributed sweets in the locality. She would have said, 'See, my son has become a teacher'. That is why I never had such aspirations. I never thought, 'If this doesn't happen, then what?' I don't burden myself with such thoughts,\" he added. ",
        "image_url": "https://c.ndtvimg.com/2025-01/s7l1t1ko_pm-modi-podcast_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 19:51:00 +0530"
    },
    {
        "title": "\"Hindi Not Our National Language\": R Ashwin Triggers Debate",
        "link": "https://sports.ndtv.com/cricket/hindi-not-our-national-language-r-ashwin-triggers-language-debate-7441061",
        "description": "Indian cricketer Ravichandran Ashwin triggered fresh 'language debate' as he suggested that Hindi isn't the country's \"national language\".",
        "full_text": "Ravichandran Ashwin, whose recent retirement stunned the world of cricket and his fans, has said that Hindi is \"not our national language but an official language\" - a comment that could trigger a debate. Ashwin made the comment at the graduation ceremony of a private engineering college in Tamil Nadu, where the use of Hindi has always been a sensitive subject that has fuelled strong reactions. Addressing students, Ashwin asked if those attending the ceremony were willing to ask questions in Hindi if they weren't comfortable in English or Tamil.\n\"English students in the house - give me a yay,\" he urged, getting a loud cheer in reply. \"Tamil\" - at this, the students roared. \"Okay, Hindi?\" In response, the audience suddenly fell silent. \"I thought I should say this. Hindi is not our national language; it is an official language,\" Ashwin went on to say, in Tamil.\n\nTamil Nadu: Former off spinner Ravichandran Ashwin says, \"...I thought I'd say it all. It's (Hindi) not our national language; It's an official language. Okay, anyway\"\n\n(09/01/2025) pic.twitter.com/bR47icWZEU\n- IANS (@ians_india) January 10, 2025\nThe comment could provoke fresh debate at a time several opposition parties, including Tamil Nadu's ruling DMK, have accused the Centre of trying to impose Hindi on states, especially in the South.\nAt the same event, Ashwin also touched upon the topic of Team India's captaincy. Here, the veteran off-spinner gave a diplomatic answer.\n\"When someone says I can't do it, I wake up to accomplish it, but if they say I can, I lose interest,\" Ashwin explained.\nAshwin also spoke about his background, having done engineering. Sharing learnings from his own journey, Ashwin asked students to never give up and remain persistent with their path, even in times of doubts.\n\"Had any engineering staff told me I couldn't become captain, I would have worked harder,\" he added, encouraging the students to stay focused and persistent when faced with doubts.\n\"If you are a student, you will never stop. If you aren't, learning will cease, and excellence will just be a word in your cupboard,\" he further said.",
        "image_url": "https://c.ndtvimg.com/2025-01/uslqg2bg_ashwin-bcci_625x300_10_January_25.jpg",
        "publishing_date": "Fri, 10 Jan 2025 12:06:00 +0530"
    },
    {
        "title": "Fresh Fire Erupts, National Guard Called In: What's Happening In Los Angeles",
        "link": "https://www.ndtv.com/world-news/los-angeles-fire-california-fire-la-fire-like-an-atomic-bomb-national-guard-called-in-as-california-fire-rages-7440378",
        "description": "The Los Angeles County Sheriff, Robert Luna, has likened the devastation caused by raging wildfires in the region to the aftermath of an atomic bomb. \"It looks as though an atomic bomb dropped in these areas,\" Mr Luna said on Thursday.",
        "full_text": "\nA fresh fire erupted Thursday evening in the West Hills neighborhood of Los Angeles, rapidly consuming over 900 acres within hours. At least 10 people have died in the fires. Firefighters have been stretched thin across Southern California as they battle multiple wildfires that have destroyed thousands of structures and forced mass evacuations.\nThe Pacific Palisades fire has scorched over 19,000 acres, while the Altadena fire has consumed 13,000 acres. Combined, these fires have displaced tens of thousands of residents.\nCalifornia's National Guard has been deployed to assist in managing the crisis.  \"We're throwing everything at our disposal - including our National Guard service members - to protect communities in the days to come,\" Governor Gavin Newsom said. He also issued a warning against looting, which has reportedly broken out in some evacuation zones.\nAmong the hardest-hit areas are Pacific Palisades and Altadena, where multi-million-dollar homes have been reduced to ashes. Celebrities such as Paris Hilton, Anthony Hopkins, and Billy Crystal are among those affected. Nearly 180,000 residents remain under evacuation orders, and the death count continues to climb. \"This is absolutely an unprecedented, historic firestorm,\" said Los Angeles Mayor Karen Bass.\nPresident Joe Biden has pledged federal resources to aid California's response to what he described as the most devastating wildfire in the state's history. \"This is the most widespread, devastating fire in California's history,\" Biden stated during a White House briefing.\nThe fires have also ignited a political clash. President-elect Donald Trump took to his Truth Social network to criticise Governor Newsom, dubbing him \"Gavin Newscum\" and accusing him of mismanagement. Trump's claims included allegations about water mismanagement and fire prevention efforts. President Biden urged Americans to avoid politicising the disaster.\nAmid President-elect Trump's aggressive campaign to incorporate Canada as the 51st state of the United States, Justin Trudeau, who recently decided to step down as PM, offered a helping hand to douse the California fires. \"Neighbours helping neighbors,\" Mr Trudeau wrote on X and shared a video of Canadian firefighters engaged in LA.\nShelters have been overwhelmed with donations from generous locals, though officials have begun redirecting supplies to other locations. The Sunset Fire in Hollywood Hills, which erupted Wednesday night, prompted the evacuation of thousands before containment efforts allowed residents to return briefly on Thursday.\nAs the fire rages, conspiracy theorists on social media have made unsubstantiated claims of firefighting equipment being sent to Ukraine or firefighter teams being understaffed due to diversity issues. \nExperts note that two decades of drought, followed by two exceptionally wet years, have created an abundance of dry vegetation that now fuels these massive blazes. Southern California's lack of heavy rainfall over the past eight months has exacerbated the problem. Meteorologists warn that conditions remain \"critical,\" with strong winds and dry weather likely to persist. \n",
        "image_url": "https://c.ndtvimg.com/2025-01/hqpbu28g_california-fire-afp-_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 11:31:00 +0530"
    },
    {
        "title": "Los Angeles Wildfires: 10 Dead, US National Guard Called In To Control Fires",
        "link": "https://www.ndtv.com/world-news/los-angeles-wildfires-live-updates-us-national-guard-called-in-survivors-survey-wreckage-7440452",
        "description": "Los Angeles Wildfires LIVE Updates: California's National Guard has been deployed to assist in Los Angeles wildfires that have killed at least five people.",
        "full_text": "Los Angeles Wildfires LIVE Updates: Los Angeles Wildfires that have killed at least five people continue ravaging the city. United States' second-largest city lay in ruins. California's National Guard has been deployed to assist in managing the crisis. The biggest blaze had ripped through over 19,000 acres of the upscale Pacific Palisades neighborhood, while another fire in Altadena had torched 13,000 acres. Neither of the two fires was contained on Thursday, but the spreading has slowed, the firefighters said. Over 9,000 structures across the city have been damaged. Nearly 180,000 people across Los Angeles remain under evacuation orders.\nAmid this, looting has broken out. At least 20 people have been arrested in the aftermath of wildfires that started on Tuesday.\nHere are LIVE updates on California wildfires:",
        "image_url": "https://c.ndtvimg.com/2025-01/tdvopesg_california-wildfire_625x300_10_January_25.jpeg",
        "publishing_date": "Fri, 10 Jan 2025 11:31:00 +0530"
    },
    {
        "title": "Virat Named As Suspect In \"Mr. Fix-It\" Row By Ex-India Star: \"No Smoke...\"",
        "link": "https://sports.ndtv.com/cricket/virat-kohli-named-as-suspect-in-mr-fix-it-row-by-ex-india-teammate-no-smoke-7442674",
        "description": "The recently-concluded Test series between India and Australia had its fair share of controversies with a number of them revolving around the Indian cricket team dressing room.",
        "full_text": "The recently-concluded Test series between India and Australia had its fair share of controversies with a number of them revolving around the Indian cricket team dressing room. With India losing the series 3-1 and failing to retain the Border-Gavaskar Trophy after 10 years, there were many reports of a rift in the team and skipper Rohit Sharma's lack of form did not help matters. A report in the Indian Express claimed that a senior player, who called himself \"Mr. Fix-It\" pitched himself as an interim captain. Former India star Robin Uthappa took to social media to criticise the unnamed cricketer for taking a selfish stand. In a recent interview, he broke his silence on the rant and explained what he felt about the matter.\n“I am the kind of person, if something is going on, I directly mention it. In the team, I know people individually. But when a tour is going on, a tournament is going on, I don't talk to any of them because every player has his own routine and mindset. At that point, it doesn't feel right to enter into their space. So I don't talk to anyone during a tournament, nor do I message anyone, even if they play good or bad. If they are playing bad, then I do drop a message to motivate them. If they have done well, made some records, then I congratulate them. But besides that I don't interact. But in this, I don't know who is Mr Fix-it. But if he has come out…” Uthappa said in an interview with Lallantop.\n“People say it is speculation. For me, in the Indian team, there is no smoke without fire,” he added.\nHe was further questioned on the topic and went on to take two names.\n“It could be KL Rahul, Virat Kohli. We think Rahul is not senior, he has been in the side for the last eight-nine years.”\n“In that sense, it is speculative. But there is another side to this also. But for me what do I care about, the Indian team being perceived right. Especially during the course of an important series. This is the most important series and during that, even if that happens, keep it inside, why take it outside. Families have differences at any point in time,” he concluded.",
        "image_url": "https://c.ndtvimg.com/2025-01/tpsla10g_csa_625x300_10_January_25.jpg",
        "publishing_date": "Fri, 10 Jan 2025 15:44:00 +0530"
    },
    {
        "title": "BCCI Asked Tough Questions Over Ashwin's Retirement, Management Under Fire",
        "link": "https://sports.ndtv.com/australia-vs-india-2024-25/bcci-asked-tough-questions-over-ravichandran-ashwins-retirement-team-management-7434696",
        "description": "During India's 2024-25 tour of Australia, R Ashwin announced his sudden retirement from international cricket. He called time on his career after the third Test.",
        "full_text": "India's historic twin Test series victories in Australia were greatly influenced by their impressive bowling line-up. However, the gap between Jasprit Bumrah and the other bowlers was clear in their recent 3-1 Border-Gavaskar Trophy series loss to Australia. While Bumrah stood head and shoulders above everyone by picking 32 wickets in his 151.2 overs at an average of 13.06 and strike rate of 28.4, India's other pacers comprising Mohammed Siraj, Akash Deep, Prasidh Krishna, Harshit Rana and Nitish Kumar Reddy took 40 scalps in 351 overs, with their average and strike-rate reading 34.82 and 52.6 respectively.\nThe inexperience of pacers and over-reliance on Bumrah does raise questions on India's fast-bowling stocks for the future. Sunil Joshi, ex-India spinner and chief selector during India's 2-1 series victory in Australia in 2020/21, is optimistic about the fast-bowling prospects but felt India missed having a left-arm pacer in their line-up.\n\"No, because we already have Troy Cooley, he's been in NCA, and is looking after the fast bowling pool. So, I don't think there should be any worry. But definitely, we did miss a left-arm seamer in that line-up.\n\"If a left-arm seamer would have been there, then there would have been a little bit of change in angles because most of the Australian, English or New Zealand batters, they are not very comfortable for the left-arm seamer because you're taking the ball away with a different angle.\n\"We just needed variety, but fortunately or unfortunately, both the bowlers Yash Dayal and Khaleel Ahmed were there, but they couldn't play, and that's unfortunate,\" said Joshi in an exclusive conversation with IANS.\nJoshi recalled the time during the 2020/21 series, where India were fielding tons of injuries to players, and the ones who went as net bowlers on tour went on to play, perform, and win games. Apart from the performances on the recent tour, India left a lot to be desired in terms of tactics to bowl to Australian batters, field placements, and bowling changes.\n\"It's all about showing character by each individual player who's on the tour to do well. For that, did we prepare very well? I think yes. Did we take responsibility? Yes. So, now from this tour, from the first Test match to the second and third matches, did we learn something from the opposition?\n\"I look at it that way because if we learned something from the opposition, then yes, we could have been better and more consistent. If you have not learned, you need to look to explore that and be disciplined to put that efforts into perspective and practice, then make a result out of it, and that's how I looked at this tour.\n\"Tactically, when it doesn't go well, then we'll be questioned. If it goes well, we say that okay, it's a good tactic used. We just need to look at what the opposition team did - like what are those tactical moves they did consistently well? Like, one can look at their fast bowlers or even at Nathan Lyon - he didn't do anything, he just kept his patience and his consistency. Did we do that? No, except Bumrah.\n\"Again, except in phases, we have done consistently - be it Nitish, Siraj, Prasidh or Harshit Rana. So finally, we need to look at ourselves did we give the best shot in terms of being disciplined? Did I play my role in the team very clearly? I'm not looking at it from an outsider point of view.\n\"I look at, 'okay, being in the dressing room, did I put my best effort? Did I put my top A game in being disciplined in these situations or sessions? Did I play my role very clearly or this and that should have been done?'. So those are the very small things, because if you break down all these things, you'll be able to understand,\" he elaborated.\nAnother development which left Joshi surprised on the tour of Australia was abrupt international retirement of off-spinner Ravichandran Ashwin, after the third Test at the Gabba ended in a draw, a game he didn't feature in.\n\"I also felt very surprised by that because I don't know what transpired or prospered during or between the second and third Test matches. But it's again Ashwin, who has been very upfront in his decisions. So I'm not saying that it was a bad decision.\n\"I mean, we need to respect that, because he has been a modern legend of the game and there's no doubt about it. But again, what transpired for him to do that? So obviously, we'll have to know because it was unbelievable, and the board, selection committee, and team management should answer that,\" he concluded.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)",
        "image_url": "https://c.ndtvimg.com/2024-12/hgesnsng_r-ashwin-afp_625x300_20_December_24.jpg",
        "publishing_date": "Fri, 10 Jan 2025 07:28:00 +0530"
    },
    {
        "title": "India's Squad Announcement Live: No Kohli-Rohit Surprise, Agarkar Set To...",
        "link": "https://sports.ndtv.com/icc-champions-trophy-2025/indias-champions-trophy-2025-squad-india-vs-england-odi-t20-full-schedule-squads-announcement-live-updates-7440002",
        "description": "India's Champions Trophy 2025 And England Series Squad Announcement Live: According to the reports, both the squads are likely to be announced by the BCCI on Friday.",
        "full_text": "India's Champions Trophy 2025 And England Series Squad Announcement Live: A huge task lies ahead for the BCCI selectors as they are set to announce the squads for the upcoming white-ball series against England and the Champions Trophy 2025. All the teams need to submit their provisional squads by February 12 and they could make changes in it until February 13. As per a report by the Indian Express, the BCCI selection committee, headed by Ajit Agarkar, is likely to pick both the squads today itself. After the debacle in the recently-concluded five-match Test series against Australia, where India lost 1-3, many tough calls are likely to be made in terms of squad selection. Some bold calls are likely to be taken.\nIndia's Squad Announcement For Champions Trophy and England ODIs Live Updates:",
        "image_url": "https://c.ndtvimg.com/2024-07/aao5cqc8_ajit-agarkar-and-gautam-gambhir-in-press-conference_625x300_22_July_24.jpg",
        "publishing_date": "Fri, 10 Jan 2025 19:24:00 +0530"
    }
]