[
    "Live Updates \n            • Powerful winds are prolonging the battle for firefighters combating the Los Angeles wildfires, which have killed at least 25 people. More than 6 million people are under a critical fire threat across a large swath of Southern California, including in cities outside of Los Angeles County.\n     \n            • A CNN analysis of the most recent data available from the 10 largest US cities and other comparable departments shows the Los Angeles Fire Department is less staffed than almost any other major city. Experts have said no fire department in the world would have been able to take on the combination of factors that resulted in the blazes.\n     \n            • The Eaton and Palisades fires are now the most destructive and second-most destructive wildfires, respectively, in Southern California history. The fires over the past week were larger and hotter than they would have in a world without planet-warming fossil fuel pollution, a UCLA analysis suggests.\n     \n            • For ways to help Los Angeles County residents, visit CNN Impact Your World.\n     \n            CNN has spoken with firefighters in California who have been sounding the alarm about staffing shortages as the state grapples with a major fire disaster.\n     \n            Here’s what they had to say:\n     \n            As many as 12,000 homes, businesses and other structures may have been destroyed in the wildfires raging in Los Angeles County, rendering entire communities ashen piles of rubble.\n     \n            But here and there amid the Palisades and Eaton fires, in places not protected by the private fire crews of the wealthy, a home survived – an apparent miracle – raising questions about how one structure can make it through while others within shouting distance burn to the ground.\n     \n            While it may be impossible ever to know for sure, several variables could be in play for those homes that survive, experts say: a smart, fire-resilient design; an owners’ preparation, like clearing away flammable vegetation; the sometimes-unknown intervention of firefighters; the wind and weather; or, frankly, luck.\n     \n            One element is the design, construction and preparation of the building. The California Department of Forestry and Fire Protection is increasingly encouraging homeowners to “harden” their homes, implementing features to help fireproof them.\n     \n            This can include building or retrofitting key parts of a home – like roof, walls, windows, decks, garages, fences and gutters, among others – with more ember- and flame-resistant materials, like concrete and steel.\n     \n            Architect Greg Chasen believes a number of these features helped save a home he designed and helped build just last year that survived the Palisades Fire: He posted on X a photo of the home, showing it almost untouched, standing pristinely next door to its neighbor, now a charred husk with a burned-out vehicle sitting on its frame in the driveway.\n     \nRead more about other elements that helped protect some homes and not others here.\n \n            The Los Angeles City Council adopted a number of resolutions on Tuesday to help residents recover from the damage of the wildfires and return to normalcy, according to the Los Angeles Times.\n \n            The measures passed include speeding up federal emergency funds, assessing the potential for mudslides, and protecting residents from evictions and price gouging, especially evacuees and pet owners, according to the LA Times.\n     \n            One proposal would pause rent increases and bar evictions for a year for tenants experiencing hardship after the fires, but the motion was referred to committee.\n     \n        “An early estimate has placed the damage to public property and infrastructure at approximately $360 million,” said the resolution regarding federal funds, adding these gaps in funding could affect essential services “such as public safety, libraries, parks, homeless services.”\n     \n \n            Separately, the LA County Board of Supervisors ordered the creation of a fund to help residents or businesses who lost their livelihoods or homes on Tuesday.\n     \n            The board voted to give the Chief Executive Officer a week to draft the parameters of the fund, which “which may include options to partner with philanthropy, receive private sector donations and provide relief and support to those impacted by the windstorm and critical fire events,” according to the meeting agenda.\n     \n        “We know that the list of needs is deep and will run the gamut from childcare to housing assistance to wage reimbursement,” said Kathryn Barger, chair of the board, at the meeting. The fund “will give an opportunity for funders to support the tremendous needs throughout the county.”\n     \n \n            The Los Angeles Fire Department did not pre-position about 1,000 available firefighters and dozens of fire engines on January 7 as winds picked up, ahead of the destructive Palisades Fire, the Los Angeles Times reported on Tuesday, citing interviews with current and former LAFD officials and internal LAFD records.\n     \n            The report claimed the LAFD staffed five of more than 40 water-carrying engines that were available last Tuesday, before the fires spun out of control. It also claimed fire officials did not order firefighters to remain on duty for a second shift, which would have doubled the number of staff on hand.\n     \n            CNN reached out to the LAFD for comment on Tuesday.\n     \n            In a statement to the LA Times, LAFD Chief Kristin Crowley defended their response and said officials had to be strategic with limited resources.\n     \n            “The plan that they put together, I stand behind, because we have to manage everybody in the city,” Crowley told the LA Times.\n     \n            She also claimed that budget cuts had slashed the LAFD’s mechanic positions — leaving some of the “ready reserve” engines out of service.\n     \nFor context: Questions over LA’s preparedness for the firestorm have led to political finger-pointing.\n     \n            LA Mayor Karen Bass has faced criticism for recent budget cuts at the LAFD, though she claimed the cuts “really did not affect what we’ve been going through.”\n     \n            The National Weather Service (NWS) has reinstated the “Particularly Dangerous Situation” (PDS) red flag warnings for parts of Los Angeles and Ventura on Wednesday as gusty winds are expected.\n     \n            The warnings had been dropped on Tuesday due to lower-than-expected winds.\n     \n            While Wednesday’s winds are not expected to be as strong as last week, winds across higher elevations could exceed 50 miles per hour. Widespread lower elevations could also see wind gusts up to 50 mph which could cause any new fires to quickly spread out of control.\n     \n            While the PDS red flag warning will continue to cover the Eaton Fire, the weather service said “winds in the Palisades fire area are expected to remain on the lower side of wind forecast”.\n     \nThe PDS red flag warning covers the following areas:\n \n            The majority of the regular red flag warnings are set to expire across Southern California by 6 p.m. PT Wednesday.\n     \n            Conditions are expected to begin to improve Thursday with winds expected to continue to decrease. The current forecast calls for gusts of 30 mph on Thursday and for the remainder of the red flag warnings to expire.\n     \n            The preliminary forecast through the weekend is for cooler and more humid air to move over Southern California, which can help to alleviate some of the dry air that has been ongoing across the region.\n     \n            While this weather is more favorable, the primary source of relief would come in the form of rounds of rainfall over the region. Unfortunately, rainfall is not in the forecast for the next seven days and doesn’t seem likely through the end of the month. Below average rainfall is expected through at least the first week of February, which is usually Southern California’s wettest month.\n     \n            Intuit Dome, the home of the LA Clippers in Inglewood, California, will host FireAid, a benefit concert aimed at raising funds for rebuilding communities devastated by wildfires in Los Angeles, according to Live Nation, the live entertainment promoting company. The event is set for January 30.\n     \n            Together with his wife Shelli, Irving Azoff, who represents a roster of iconic artists including The Eagles, Fleetwood Mac and Maroon 5, among others, is spearheading the initiative in collaboration with Live Nation and AEG Presents, which belongs to Anschutz Entertainment Group. Azoff’s son, Jeffrey, manages former One Direction’s Harry Styles, fueling speculation about potential hosts for the concert. Azoff is partly owner of MSG, the entertainment company operating the Madison Square Garden in New York.\n     \n            Live Nation says the lineup for the concert, described as “an evening of music and solidarity,” will be announced soon.\n     \n            Proceeds from the concert will go towards a nonprofit created for this event that will focus on rebuilding infrastructure, supporting displaced families, and advancing fire prevention technologies and strategies to ensure Southern California is better prepared for fire emergencies, the release says.\n     \n            The announcement follows a pledge from The Recording Academy and nonprofit MusiCares, which committed $1 million to support music professionals impacted by the wildfires, according to a release.\n     \n            “The entire Grammy family is shocked and deeply saddened by the situation unfolding in Los Angeles,” Harvey Mason Jr., CEO of the Recording Academy and MusiCares said in a statement. “The music community is being so severely impacted, but we will come together as an industry to support one another.”\n     \n            As firefighters battle several blazes across metro Los Angeles, high wind conditions across the region in the hours ahead remain a challenge.\n     \n            Forecasters expected winds to uptick from Tuesday night through Wednesday. More than 6 million people are under a critical fire threat Wednesday across several counties in Southern California, including cities outside of Los Angeles County such as Anaheim, Riverside, San Bernardino and Oxnard.\n     \n            Northeast winds at 20 to 30 mph are forecast with gusts of 50 mph possible, the National Weather Service cautioned.\n     \nHere are the latest developments:\n \nDeath toll climbs: The fires have killed at least 25 people — nine in the Palisades Fire and 16 in the Eaton Fire.\n     \nAir quality remains low: People in areas impacted by ash from the wildfires should wear proper respiratory masks to help protect against potential health problems, a city health official said. A windblown dust and ash advisory covering close to 17 million residents is in effect through 7 p.m. Wednesday.\n     \nState combats predatory real estate offers: Gov. Gavin Newsom issued an executive order preventing “aggressive and unsolicited cash offers” under market value to wildfire victims in 15 zip codes in the Los Angeles area, saying, “We will not allow greedy developers to rip off these working-class communities at a time when they need more support than ever before.”\n     \nTemporary relocation of schools: Two schools in the Palisades that burned down will resume classes on temporary campuses, as the Los Angeles Unified School District works to “return to normalcy,” the district said. Last week, the superintendent said at least a third of all students in the district — the second-largest school district nationwide and the largest in California — are being impacted in some way by the fires.\n     \nImpacts of climate change: The fires over the past week were larger and burned hotter than they would have in a world without planet-warming fossil fuel pollution, a UCLA analysis suggests. The report is clear in saying the fires likely still would have occurred in a world without climate pollution, but it concludes they would have been “somewhat smaller and less intense.”\n     \n            CNN’s Josh Campbell reports on the controversy surrounding some private firefighters being hired by some neighborhoods and insurance companies to step in for a Los Angeles Fire Department stretched thin.\n     \n            Longtime Altadena resident Kimberly Winiecki, 77, has been identified as a victim of the Eaton Fire, her close friend Jeannette McMahon told CNN.\n     \n            McMahon last saw Winiecki on January 6, the day before the Eaton Fire broke out, she said.\n     \n            “We were good friends. On Monday night we had dinner, well, what we didn’t know was going to be our farewell dinner,” McMahon said.\n     \n            McMahon told CNN she tried to help Winiecki evacuate when the fire broke out.\n     \n            “The winds picked up on Tuesday and then around 8 p.m. I could see the fire from my home, so I texted Kim and said, ‘Kim, I need to come pick you up,” McMahon said. “She responded and said ‘I’m fine. I’m calm.’”\n     \n            McMahon said she was unable to get in touch with Winiecki after that day but eventually spoke with Winiecki’s brother who informed her officials had contacted him to notify him of Winiecki’s death.\n     \n            “She was a very intelligent woman, just so sensitive and expressive. She was a writer and a delight to be with. It was such a joy to be around her,” McMahon said about her friend.\n     \n            For the last 20 years, McMahon said she and Winiecki met at least twice a week.\n     \n            “I had many parties; dinner parties and gatherings and Kim was a part of them. She didn’t like being in pictures, but she used to love taking photos of our gatherings and table settings and sending the photos to her sister. I’ll miss her insightfulness and wittiness.”\n     \n            Republicans in Congress will consider “culpability” when approving any disaster aid for Democratic-led California, said House Speaker Mike Johnson Tuesday, as deadly wildfires ravage Los Angeles County for a second week.\n     \n            “We’re all Americans, and the Americans there, that are affected, desperately need and deserve help,” Johnson said during a news conference, but noted “concerns” over how California is governed, at the state and local levels.\n     \n        “To the extent that there is complicity involved in the scope of the disaster, then we think that’s something that needs to be carefully regarded.” \n     \n \n            Any wildfire aid package should have conditions, the speaker told reporters, including CNN’s Manu Raju, on Monday.\n     \n            “If Gavin Newsom and local leaders made decisions that made this disaster exponentially worse — which it appears there were — should there be some consequence of that? Should there be some kind of safeguard on the funding?” Johnson told reporters. People in other states should not have to pay for “bad decisions” made in California, Johnson said.\n     \n            While Johnson did not elaborate on potential conditions, he said Republicans do not intend to leave Americans behind.\n     \n            “We may need to think carefully about safeguards,” Johnson added, pointing to the conditions on flood insurance included in the Hurricane Katrina aid package for his home state of Louisiana two decades ago.\n     \n            The widespread destruction caused by the Eaton and the Palisades fires have led Cal Fire to rank them as the first and second-most destructive fires in Southern California, respectively.\n     \n            The Eaton Fire has taken the position of the most  destructive and deadly fire in Southern California history, according to  CalFire. The fire has burned over 14,000 acres and 7,000 structures,  according to the agency’s count. It has killed 17 people, according to  the Los Angeles County Medical Examiner’s office.\n     \n            The Palisades Fire ranks as the second-most destructive fire  in Southern California history, with more than 23,000 acres and 5,000  structures burned. The county medical examiner’s office has confirmed  the Palisades Fire has killed at least eight people.\n     \n            The previous record for the most deadly and destructive fire in Southern California was the Cedar Fire in October 2003. This fire burned nearly 3,000 structures and killed 15 people in San Diego County.\n     \n            A CNN analysis of the most recent data available from the 10 largest US cities and other comparable departments shows the Los Angeles Fire Department is less staffed than almost any other major city.\n     \n            Less than a month before the fires swept across Los Angeles  County, a group of longtime firefighters gathered at City Hall to plead  for more resources, according to the report by CNN Investigates.\n     \n            “I’m going to say what people can’t say,” said Freddy Escobar,  president of the city’s fire union and a veteran firefighter. “If we cut  one position, if we close one station … the residents of Los Angeles  are going to pay the ultimate sacrifice, and someone will die.”\n     \n            Experts have said no fire department in the world would have  been able to take on such a perfect storm of conditions that resulted  in LA’s devastating blazes – which have burned more than 40,000 acres,  destroyed more than 12,000 structures and caused at least 24 deaths.\n     \n            But images of residents in some neighborhoods trying to save  homes with garden hoses and no firefighters in sight have sparked a new  debate over whether city officials should have planned better and  invested more in the LAFD, and what should be done to become better  positioned for the next emergency.\n     \n            Despite being located in one of the most fire-prone areas in  the country, the LAFD has less than one firefighter for every 1,000  residents, the data shows.\n     \n            That compares to cities such as Chicago, Dallas and Houston, where staffing is closer to two firefighters for the same number of residents. Of the largest cities, only San Diego has fewer firefighters per capita.\n     © 2025 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.",
    "At least 25 people have died in the Los Angeles fires as two major blazes continue to burn across the sprawling US city. Firefighters made progress over the weekend in containing the Palisades and Eaton fires but warn that the return of high winds - forecast until Wednesday - could see these two spread again, or fuel new ones. The fires are already among the most destructive in LA's history when measured by the number of buildings destroyed. Rebuilding work will cost \"tens of billions\" of dollars, US President Joe Biden has said. An area to the north-west of the city centre is described by officials as \"particularly dangerous\". A red flag warning - indicating a high level of fire danger - is in place until 18:00 (02:00 GMT) on Wednesday, with the strongest Santa Ana winds expected on Tuesday. Nearby, the largest fire is in the Palisades area, and has burnt through more than 23,000 acres. It is still only about 14% contained, despite the efforts of thousands of firefighters. The blaze is moving east, threatening the exclusive neighbourhood of Brentwood, home to the Getty Center, a world-famous art museum that has evacuated its staff. Another fire, Eaton, is more deadly than Palisades so far - responsible for 16 of the deaths.  The overall destruction is immense, with more than 12,000 structures - homes, outbuildings, sheds, mobile homes and cars - destroyed. Celebrities Mel Gibson and Paris Hilton are among those who have lost their homes. Tens of thousands of homes are also without power. The fires could turn out to be the costliest in US history, with damage projected at up to $150bn, according to a preliminary estimate by AccuWeather. There are three active fires in the wider area, while a smaller fire is nearly contained, say California fire officials: The earlier Kenneth, Archer, Sunset, Lidia, Woodley and Olivas fires have been contained. Containment describes the progress firefighters make in controlling the spread of flames. It is often listed as a percentage. For example, if a fire is 14% contained, that means fire crews have established barriers around 14% of the fire's perimeter. Natural barriers include roads, rivers and oceans. Firefighters can also create barriers using equipment such as bulldozers, hoses and shovels to remove vegetation down to the bare soil, meaning there is nothing for the fire to burn. A fire being 100% contained doesn't mean it has been extinguished, but rather that the flames have been fully encircled and the spread has been effectively stopped. Detectives continue to investigate the possible causes.  Lightning - the most common source of fires in the US - has been ruled out as a cause for the Palisades and Eaton fires. There has been no official indication so far that arson or utility lines - the next two biggest culprits in sparking fires - caused any of the conflagrations. However, in the case of the Eaton fire, legal cases have been filed against the electrical company, Southern California Edison Company (SCE), claiming there is evidence that the blaze - one of the largest - was ignited due to negligence of the firm's overhead wires. SCE has vowed to \"review the complaint when it is received\", pointing out that \"the cause of the fire continues to be under investigation\". A spokeswoman added that the company \"remains committed\" to supporting communities affected by the fires.  On Friday, SCE said authorities were investigating whether its infrastructure was involved in the ignition of the separate Hurst fire.  California's very wet years of 2022-23 brought about a huge growth of vegetation, which dried out in the drought of last year, creating abundant kindling. Conditions have been ripe for wildfires thanks to a combination of an exceptionally dry period - downtown LA has only received 0.16 inches (0.4cm) of rain since October - and powerful offshore gusts known as the Santa Ana winds. A political row about the city's preparedness has erupted after it emerged some fire crews' hoses ran dry. California Governor Gavin Newsom has called for an independent investigation into the loss of water pressure to hydrants and why the Santa Ynez Reservoir was closed for maintenance and empty when the fire broke out. \"Losing supplies from fire hydrants likely impaired the effort to protect some homes and evacuation corridors,\" he wrote. LA Mayor Karen Bass, who was on a previously arranged trip to Ghana when the fires began, has faced intense questions about the region's preparedness and the water issues. On Saturday, she deflected questions about her handling of the emergency. Before the fires broke out, the city of LA's fire chief warned in a memo that budget cuts were hampering the department's ability to respond to emergencies. But another official, the LA County fire chief, denied his department had been unprepared.  Although strong winds and lack of rain are driving the blazes, experts say climate change is altering the background conditions and increasing the likelihood of such fires. Much of the western United States including California experienced a decades-long drought that ended just two years ago, making the region vulnerable. \"Whiplash\" swings between dry and wet periods in recent years created a massive amount of tinder-dry vegetation that was ready to burn. US government research is unequivocal in linking climate change to larger and more severe wildfires in the western US. \"Climate change, including increased heat, extended drought, and a thirsty atmosphere, has been a key driver in increasing the risk and extent of wildfires in the western United States,\" the National Oceanic and Atmospheric Administration says. Fire season in southern California is generally thought to stretch from May to October - but the Governor Newsom has pointed out earlier that blazes are now a perennial issue. \"There's no fire season,\" he said. \"It's fire year.\"  No one can say when the Los Angeles fires will finally go out. The city is bracing for continued burning and a possible spread amid the latest wind warnings. The Santa Ana winds that fanned the flames are set to strengthen, with strong gusts on Tuesday before the severity is expected to drop. There are now new red flag warnings for dangerous wind storms. The other conditions that fed the fire - dry brush and lack of precipitation  - continue as well. Have you been affected by the fires in California? Get in touch here. Sign up for our Future Earth newsletter to get exclusive insight on the latest climate and environment news from the BBC's Climate Editor Justin Rowlatt, delivered to your inbox every week. Outside the UK? Sign up to our international newsletter here. Two landers owned by US and Japanese companies to carry out separate tests on the Moon's surface. US President-elect Donald Trump's nominee was grilled for hours about his ability to run the defence department. Maps and images showing how the fires currently affecting the Los Angeles area are developing. President Biden moves to reverse the designation introduced by Donald Trump before he returns to office. Donald Trump's defence secretary nominee was asked about his stance on women in combat and his alleged excessive drinking. Copyright 2025 BBC. All rights reserved.  The BBC is not responsible for the content of external sites. Read about our approach to external linking."
]